In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "Name":['Aman Kushwah', 'Saket', 'Ravi'],
    "Age": [19, 23,20],
    "City": ['Agra', 'Delhi', 'Noida']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

           Name  Age   City
0  Aman Kushwah   19   Agra
1         Saket   23  Delhi
2          Ravi   20  Noida

In [6]:
df.to_csv('Details.csv')

In [7]:
# To not use the indexes we use (Index = False)
df.to_csv('info.csv', index = False)

In [8]:
# To see the Top above Rows we use:
df.head(2)

           Name  Age   City
0  Aman Kushwah   19   Agra
1         Saket   23  Delhi

In [9]:
# To see the top down Rows we use:
df.tail(2)

    Name  Age   City
1  Saket   23  Delhi
2   Ravi   20  Noida

In [11]:
df.describe()

             Age
count   3.000000
mean   20.666667
std     2.081666
min    19.000000
25%    19.500000
50%    20.000000
75%    21.500000
max    23.000000

In [12]:
aman =  pd.read_csv('info.csv')

In [13]:
aman

           Name  Age   City
0  Aman Kushwah   19   Agra
1         Saket   23  Delhi
2          Ravi   20  Noida

In [15]:
aman['Age'][1] = 25

C:\Users\ASUS1\AppData\Local\Temp\ipykernel_15948\4216179002.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  aman['Age'][1] = 25
C:\Users\ASUS1\AppData\Local\Temp\ipykernel_15948\4216179002.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  aman['Age'][1] = 25

In [16]:
aman

           Name  Age   City
0  Aman Kushwah   19   Agra
1         Saket   25  Delhi
2          Ravi   20  Noida

In [17]:
# To change the index in ordinals
aman.index = ['First', 'Second', 'Third']

In [18]:
aman

                Name  Age   City
First   Aman Kushwah   19   Agra
Second         Saket   25  Delhi
Third           Ravi   20  Noida

In [19]:
ser= pd.Series(np.random.rand(34))

In [21]:
print(ser)
print(type(ser))

0     0.519511
1     0.049132
2     0.905647
3     0.983972
4     0.573458
5     0.862822
6     0.797958
7     0.226518
8     0.292853
9     0.680951
10    0.091291
11    0.758269
12    0.131716
13    0.606896
14    0.442262
15    0.011584
16    0.200712
17    0.928502
18    0.117394
19    0.706682
20    0.768069
21    0.046714
22    0.215182
23    0.471088
24    0.173756
25    0.587470
26    0.418726
27    0.574234
28    0.470449
29    0.055986
30    0.132720
31    0.042909
32    0.825380
33    0.684629
dtype: float64
<class 'pandas.core.series.Series'>